saewoonam/ble_adv_covid/nrf52 dongle/usbd_ble_covid/main.c
   // ret = bsp_indication_set(BSP_INDICATE_SCANNING);
   // APP_ERROR_CHECK(ret);
}
/**@brief Function for initializing the scanning and setting the filters.
 */

static ble_uuid_t const contact_uuid =
{
    .uuid = 0xFD6F,
    .type = BLE_UUID_TYPE_BLE 
};

static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = false;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    //err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    err_code = nrf_ble_scan_init(&m_scan, &init_scan, NULL);
    APP_ERROR_CHECK(err_code);

    
    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &contact_uuid);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
    APP_ERROR_CHECK(err_code);
    
}

int frame_counter=0;

static int check_for_service(uint8_t *data, uint8_t length, uint8_t *uuid)
{
    uint8_t *ptr;
    ptr = data;
    uint8_t index = 0;
    uint8_t sublength;
    uint8_t ad_type;
    bool result = false;

    if (length>0) {
        do {
            sublength = ptr[0];
            ad_type = ptr[1];
            if (sublength==2) {  // its a flag
                ;
            } else if (sublength==3) {
                result = result || ((ptr[2]==uuid[0]) && (ptr[3]==uuid[1]));
            }
            ptr += sublength + 1;
            index += sublength + 1;
        } while (index < length);
    } 
    return result;
}

/**
 * @brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT: /*
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            } */
            break;

        case BSP_EVENT_WHITELIST_OFF:
            break;

        default:
            break;
    }
}

void calc_RPI(uint8_t *data) {
    static uint8_t count=0;
    for(uint8_t i=0; i<16; i++) {
      data[i] = i;
    }  
    data[15]=count++;
}

static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    uint8_t       flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    
    flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    

    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

    m_adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
    m_adv_params.p_peer_addr     = NULL;    // Undirected advertisement.
    m_adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval        = NON_CONNECTABLE_ADV_INTERVAL;
    m_adv_params.duration        = 2000;    //   Change this time randomly...

    m_adv_data.adv_data.p_data[0] = 0x2;  // Set TX_POWER
    m_adv_data.adv_data.p_data[1] = 0xA;
    m_adv_data.adv_data.p_data[2] = 0x04;  //SET tx power... need to change this
    m_adv_data.adv_data.p_data[3] = 0x02;  // SET Flags
    m_adv_data.adv_data.p_data[4] = 0x01;
    m_adv_data.adv_data.p_data[5] = 0x06;
    m_adv_data.adv_data.p_data[6] = 0x03;  // Set contact UUID
    m_adv_data.adv_data.p_data[7] = 0x03;
    m_adv_data.adv_data.p_data[8] = 0x6F;
    m_adv_data.adv_data.p_data[9] = 0xFD;
    m_adv_data.adv_data.p_data[10] = 0x13;
    m_adv_data.adv_data.p_data[11] = 0x16;
    m_adv_data.adv_data.p_data[12] = 0x6F;
    m_adv_data.adv_data.p_data[13] = 0xFD;
    calc_RPI(m_adv_data.adv_data.p_data+14);
    /*
    for(uint8_t i=0; i<16; i++) {
      m_adv_data.adv_data.p_data[14+i] = i;
    } 
    */
    m_adv_data.adv_data.len = 14+16;

    //m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
uint8_t contact[2] = {0x6F, 0xFD};
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;
    size_t size=0;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            break;

        case BLE_GAP_EVT_ADV_SET_TERMINATED:{
            // Calculate new rpi
            ret_code_t ret = app_timer_stop(m_blink_ble);
            APP_ERROR_CHECK(ret);
            advertising_init();
            advertising_start();

        }
        case BLE_GAP_EVT_ADV_REPORT:
        {       
            ble_gap_evt_adv_report_t const* adv = &p_ble_evt->evt.gap_evt.params.adv_report;
            bool contact_bool = check_for_service(adv->data.p_data, adv->data.len, contact);
            if (contact_bool) {
                blink(1, LED_CONTACT);                
                if (cdc_open && m_usb_connected) {  // Only send stuff if serial port is open
                  // while (ready==0) {nrfx_coredep_delay_us(1000);} // wait until previous TX is done
                  // timetag does not work
                  //unsigned long timetag;
                  // nrfx_systick_get(&timetag);
                  // build message
                  size = sprintf(m_tx_buffer, "%d ", adv->rssi);
                  //size += sprintf(m_tx_buffer+size, "%ld ", timetag); 
                  size += sprintf(m_tx_buffer+size, "[%02x:%02x:%02x:%02x:%02x:%02x]",
                          adv->peer_addr.addr[5], adv->peer_addr.addr[4], adv->peer_addr.addr[3],
                          adv->peer_addr.addr[2], adv->peer_addr.addr[1], adv->peer_addr.addr[0]);
                  // size += sprintf(m_tx_buffer+size, " dlen: %d", adv->data.len);
                  if (adv->data.len>0) {
                    for (uint8_t i=0; i<adv->data.len; i++) {
                      //if (i>0) size+=sprintf(m_tx_buffer+size, "-");
                      //size+= sprintf(m_tx_buffer+size, "%02x", adv->data.p_data[i]);
                      *(m_tx_buffer+size) = adv->data.p_data[i];
                      size++;
                    }  
                  }
                  size += sprintf(m_tx_buffer+size, "\n");
                  ready=0;
                  err_code = app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, size);
                  APP_ERROR_CHECK(err_code);
                }
            }
            break;
        }
        default:
            // No implementation needed.
            break;
    }
}


/**
 * @brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/** @brief Function for initializing buttons and LEDs. */
static void buttons_leds_init(void)
{
    uint32_t err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the nrf_log module. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/** @brief Function for placing the application in low power state while waiting for events. */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**
 * @brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    power_manage();
}


